PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog_sar.c
/***************************************************************************//**
* \file cy_autanalog_sar.c
* \version 2.0
*
* \brief
* Provides an API definition for the SAR ADC in the Autonomous Analog driver.
*
********************************************************************************
* \copyright
* Copyright 2022-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#include <string.h>
#include "cy_autanalog_sar.h"

#ifdef CY_IP_MXS22LPPASS_SAR

/* Validation macros for HS/LP sequencers */
#define AUTANALOG_SAR_SEQ_NUM(value)                        ((value) <=  CY_AUTANALOG_SAR_SEQUENCER_NUM)
#define AUTANALOG_SAR_SEQ_MUX_MODE(value)                   ((value) <= 0x04UL)
#define AUTANALOG_SAR_SEQ_MUX_SEL(value)                    ((value) <= 0x0FUL)
#define AUTANALOG_SAR_SEQ_SAMPLE_TIME(value)                ((value) <= CY_AUTANALOG_SAR_SAMPLE_TIME3)
#define AUTANALOG_SAR_SEQ_AVG_CNT(value)                    ((value) <= CY_AUTANALOG_SAR_ACC_CNT256)
#define AUTANALOG_SAR_SEQ_CAL_REQ(value)                    ((value) <= CY_AUTANALOG_SAR_CAL_LINEARITY)
#define AUTANALOG_SAR_SEQ_NEXT_STATE(value)                 ((value) <= CY_AUTANALOG_SAR_NEXT_ACTION_GO_TO_NEXT)
/* Validation macros for static cfg */
#define AUTANALOG_SAR_STA_CFG_CH_DEFAULT_GAIN               (0x8000UL)
#define AUTANALOG_SAR_STA_CFG_CH_DEFAULT_OFFSET             (0x0UL)
#define AUTANALOG_SAR_STA_CFG_TR_HS_CH_DEFAULT_SAMPLE_TIME  (31UL)
#define AUTANALOG_SAR_STA_CFG_TR_LP_CH_DEFAULT_SAMPLE_TIME  (5UL)
#define AUTANALOG_SAR_STA_CFG_SAMPLE_TIME(value)            ((value) <= SAR_STA_TR_SAMPLE_TIME_HS_TR_SAMPLE_TIME_Msk)
#define AUTANALOG_SAR_STA_CFG_FIR_MASK(value)               ((value) <= SAR_STA_FIR_RESULT_MASK_FIR_RESULT_MASK_Msk)
#define AUTANALOG_SAR_STA_CFG_CH_GAIN(value)                ((uint16_t)(value) != 0U)
#define AUTANALOG_SAR_STA_CFG_CH_OFFSET(value)              (((int16_t)(value) >= -2048) && ((int16_t)(value) <= 2047))
/* Validation macros for CTRL register */
#define AUTANALOG_SAR_CTRL_VREF(value)                      ((value) <= CY_AUTANALOG_SAR_VREF_PRB_OUT1)
#define AUTANALOG_SAR_CTRL_BUFF_PWR(value)                  ((value) <= CY_AUTANALOG_SAR_BUF_PWR_ULTRA_HIGH_RAIL)
#define AUTANALOG_SAR_CTRL_AVG_MODE(value)                  ((value) <= CY_AUTANALOG_SAR_ACC_ACCUNDUMP)
#define AUTANALOG_SAR_CTRL_STARTUP_CAL(value)               ((value) <= CY_AUTANALOG_SAR_CAL_LINEARITY)
/* Validation macros for GPIO CH CFG registers */
#define AUTANALOG_SAR_GPIO_PIN(value)                       ((value) <= CY_AUTANALOG_SAR_PIN_GPIO7)
#define AUTANALOG_SAR_CH_COEF(value)                        ((value) <= CY_AUTANALOG_SAR_CH_COEFF7)
/* Validation macros for MUX CH CFG registers */
#define AUTANALOG_SAR_MUX_PIN(value)                       (((value) <= CY_AUTANALOG_SAR_PIN_MUX_GPIO7) || \
                                                            ((value) == CY_AUTANALOG_SAR_PIN_MUX_VSSA))
/* Validation macros for STATUS registers */
#define AUTANALOG_SAR_STATUS_SEL(value)                     ((value) <= CY_AUTANALOG_SAR_LIMIT_STATUS_STC3)
#define AUTANALOG_SAR_STATUS_COND(value)                    ((value) <= CY_AUTANALOG_SAR_COND_OUTSIDE)
/* Validation macros for FIR registers */
#define AUTANALOG_SAR_FIR_CHANNEL_SEL(value)                ((value) <= CY_AUTANALOG_SAR_FIR_CH_MUX15)
#define AUTANALOG_SAR_FIR_TAP_SEL(value)                    ((value) < CY_AUTANALOG_SAR_FIR_TAP_NUM)
#define AUTANALOG_SAR_FIR_SHIFT_SEL(value)                  ((value) <= 0x0FUL)
/* Validation macros for FIFO registers */
#define AUTANALOG_MMIO_FIFO_CFG(value)                      ((value) <= CY_AUTANALOG_FIFO_SPLIT8)
/* Validation macros for FIFO LEVEL register */
#define AUTANALOG_MMIO_FIFO_SEL(value)                      ((value) <= CY_AUTANALOG_FIFO_SELECT7)
#define AUTANALOG_MMIO_FIFO_LEVEL(value)                    ((value) <= LPPASS_MMIO_STA_LEVEL_LEVEL_Msk)
/* Position of the sign in FIFO data with channel ID */
#define AUTANALOG_MMIO_FIFO_SIGN_POS                        (23U)
#define AUTANALOG_MMIO_FIFO_SIGN_MASK                       (0x1UL << AUTANALOG_MMIO_FIFO_SIGN_POS)
/* Position of the channel ID in FIFO data for GPIO channels */
#define AUTANALOG_MMIO_FIFO_CH_ID_POS_GPIO                  (24U)
#define AUTANALOG_MMIO_FIFO_CH_ID_MASK_GPIO                 (0x7UL << AUTANALOG_MMIO_FIFO_CH_ID_POS_GPIO)
/* Position of the channel ID in FIFO data for MUX channels */
#define AUTANALOG_MMIO_FIFO_CH_ID_POS_MUX                   (28U)
#define AUTANALOG_MMIO_FIFO_CH_ID_MASK_MUX                  (0xFUL << AUTANALOG_MMIO_FIFO_CH_ID_POS_MUX)
/* SAR ADC conversion macros */
#define AUTANALOG_SAR_SEQ_IDX(value)                        ((value) <  CY_AUTANALOG_SAR_SEQUENCER_NUM)
#define AUTANALOG_SAR_VREF_MAX(value)                       ((value) <= 1800) /* Vdda is 1.8V */
#define AUTANALOG_SAR_10V_COUNTS                            (10UL)
#define AUTANALOG_SAR_10mV_COUNTS                           (10000UL)
#define AUTANALOG_SAR_10uV_COUNTS                           (10000000UL)
#define AUTANALOG_SAR_MAX_BITS12                            (0x00001000L)
#define AUTANALOG_SAR_MAX_BITS16                            (0x00010000L)
#define AUTANALOG_SAR_OFFSET_BITS12                         (AUTANALOG_SAR_MAX_BITS12 / 2L)
#define AUTANALOG_SAR_OFFSET_BITS16                         (AUTANALOG_SAR_MAX_BITS16 / 2L)
/* SAR ADC die temperature macros */
#define AUTANALOG_SAR_TEMP_DIV                              (0x10000L)  /* 1 in Q16.16 format */
#define AUTANALOG_SAR_TEMP_HALF                             (0x8000L)   /* 0.5 in Q16.16 format */


/* Global variables for die temperature trimmings */
uint32_t cyAutanalogTempMultiplierHS = 0x00016000UL;
uint32_t cyAutanalogTempOffsetHS     = 0xFEDC6000UL;
uint32_t cyAutanalogTempMultiplierLP = 0x00016000UL;
uint32_t cyAutanalogTempOffsetLP     = 0xFEDC6000UL;


