PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog_sar.c
/* Forward declarations */
#if !defined (CY_AUTANALOG_FIR_DISABLE)
    static cy_en_autanalog_status_t SAR_LoadFIR(uint8_t sarIdx, uint8_t cfgNum, const cy_stc_autanalog_sar_fir_cfg_t * firCfg);
#endif
static void SAR_LoadGpioChan(uint32_t baseAddr, uint8_t cfgNum, cy_stc_autanalog_sar_hs_chan_t * const hsGpioChan[]);
static void SAR_LoadMuxChan(uint32_t baseAddr, uint8_t cfgNum, cy_stc_autanalog_sar_mux_chan_t * const intMuxChan[]);
static void SAR_LoadRangeCond(uint32_t baseAddr, uint8_t cfgNum, cy_stc_autanalog_sar_limit_t * const limitCond[]);
static int32_t SAR_CheckChanOffset(uint32_t baseAddr, bool sarLP, uint8_t sarSequencer, cy_en_autanalog_sar_input_t sarInput,
                                   uint8_t sarChannel, bool sarMode16);
static int32_t SAR_GetAverageVoltCounts(uint32_t baseAddr, bool sarLP, uint8_t sarSequencer,
                                        cy_en_autanalog_sar_input_t sarInput, uint8_t sarChannel, int32_t sarCounts, bool * sarMode16);
static int32_t SAR_GetAverageTempCounts(bool avgShiftMode16, uint8_t avgCnt, int32_t sarCounts);
static int32_t SAR_CountsToDegreeC(bool sarLP, int32_t sarCounts);


cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadConfig(uint8_t sarIdx, const cy_stc_autanalog_sar_t * sarCfg)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_SAR_BAD_PARAM;

    if (NULL != sarCfg)
    {
        result = Cy_AutAnalog_SAR_LoadStaticConfig(sarIdx, sarCfg->sarStaCfg);

        /* The High Speed configuration might be optional */
        if ((CY_AUTANALOG_SUCCESS == result) && (0U != sarCfg->hsSeqTabNum) && (NULL != sarCfg->hsSeqTabArr))
        {
            result = Cy_AutAnalog_SAR_LoadHSseqTable(sarIdx, sarCfg->hsSeqTabNum, sarCfg->hsSeqTabArr);
        }

        /* The Low Power configuration might be optional */
        if ((CY_AUTANALOG_SUCCESS == result) && (0U != sarCfg->lpSeqTabNum) && (NULL != sarCfg->lpSeqTabArr))
        {
            result = Cy_AutAnalog_SAR_LoadLPseqTable(sarIdx, sarCfg->lpSeqTabNum, sarCfg->lpSeqTabArr);
        }

        /*
         * Enables the required start-up/settling delay for the ADC
         */
        /* ADC is configured for operation in both modes HS and LP */
        if ((NULL != sarCfg->sarStaCfg) && (CY_AUTANALOG_SUCCESS == result) &&
                (NULL != sarCfg->sarStaCfg->hsStaCfg) && (0U != sarCfg->hsSeqTabNum) &&
                (NULL != sarCfg->sarStaCfg->lpStaCfg) && (0U != sarCfg->lpSeqTabNum))
        {
            /* Internal Vref used for at least one ADC core */
            if (((CY_AUTANALOG_SAR_VREF_VDDA != sarCfg->sarStaCfg->hsStaCfg->hsVref) &&
                    (CY_AUTANALOG_SAR_VREF_VDDA_BY_2 != sarCfg->sarStaCfg->hsStaCfg->hsVref) &&
                    (CY_AUTANALOG_SAR_VREF_EXT != sarCfg->sarStaCfg->hsStaCfg->hsVref)) ||
                    ((CY_AUTANALOG_SAR_VREF_VDDA != sarCfg->sarStaCfg->lpStaCfg->lpVref) &&
                     (CY_AUTANALOG_SAR_VREF_VDDA_BY_2 != sarCfg->sarStaCfg->lpStaCfg->lpVref) &&
                     (CY_AUTANALOG_SAR_VREF_EXT != sarCfg->sarStaCfg->lpStaCfg->lpVref)))
            {
                AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP2) |= INFRA_PRIO_CFG_SAR_READY_Msk;
            }
            else
            {
                AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP1) |= INFRA_PRIO_CFG_SAR_READY_Msk;
            }
        }
        /* ADC is configured for operation in HS mode */
        else if ((NULL != sarCfg->sarStaCfg) && (CY_AUTANALOG_SUCCESS == result) &&
                 (NULL != sarCfg->sarStaCfg->hsStaCfg) && (0U != sarCfg->hsSeqTabNum))
        {
            /* Internal Vref */
            if ((CY_AUTANALOG_SAR_VREF_VDDA != sarCfg->sarStaCfg->hsStaCfg->hsVref) &&
                    (CY_AUTANALOG_SAR_VREF_VDDA_BY_2 != sarCfg->sarStaCfg->hsStaCfg->hsVref) &&
                    (CY_AUTANALOG_SAR_VREF_EXT != sarCfg->sarStaCfg->hsStaCfg->hsVref))
            {
                AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP2) |= INFRA_PRIO_CFG_SAR_READY_Msk;
            }
            /* External Vref */
            else
            {
                AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP1) |= INFRA_PRIO_CFG_SAR_READY_Msk;
            }
        }
        /* ADC is configured for operation in LP mode */
        else if ((NULL != sarCfg->sarStaCfg) && (CY_AUTANALOG_SUCCESS == result) &&
                 (NULL != sarCfg->sarStaCfg->lpStaCfg) && (0U != sarCfg->lpSeqTabNum))
        {
            /* Internal Vref */
            if ((CY_AUTANALOG_SAR_VREF_VDDA != sarCfg->sarStaCfg->lpStaCfg->lpVref) &&
                    (CY_AUTANALOG_SAR_VREF_VDDA_BY_2 != sarCfg->sarStaCfg->lpStaCfg->lpVref) &&
                    (CY_AUTANALOG_SAR_VREF_EXT != sarCfg->sarStaCfg->lpStaCfg->lpVref))
            {
                AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP2) |= INFRA_PRIO_CFG_SAR_READY_Msk;
            }
            /* External Vref */
            else
            {
                AUTANALOG_INFRA_PRIO_CFG(INFRA_BASE, CY_AUTANALOG_PRIORITY_GROUP1) |= INFRA_PRIO_CFG_SAR_READY_Msk;
            }
        }
        else
        {
            /* MISRA */
        }

#if !defined (CY_AUTANALOG_FIR_DISABLE)
        /* FIR filter configuration */
        if ((CY_AUTANALOG_SUCCESS == result) && (sarCfg->firNum > 0U))
        {
            result = SAR_LoadFIR(sarIdx, sarCfg->firNum, sarCfg->firCfg);
        }
#endif

#if !defined (CY_AUTANALOG_FIFO_DISABLE)
        /* Currently, single instance of FIFO is tightly linked with SAR */
        if ((CY_AUTANALOG_SUCCESS == result) && (NULL != sarCfg->fifoCfg))
        {
            result = Cy_AutAnalog_FIFO_LoadConfig(0U, sarCfg->fifoCfg);
        }
#endif
    }

    return result;
}


cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadStaticConfig(uint8_t sarIdx, const cy_stc_autanalog_sar_sta_t * sarStaCfg)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_SAR_BAD_PARAM;

    uint32_t baseAddr;
    uint32_t regVal;
    uint8_t cfgIdx;

    if (NULL != sarStaCfg)
    {
        result = Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr);

        if (CY_AUTANALOG_SUCCESS == result)
        {
            uint16_t hsSampleTime[CY_AUTANALOG_SAR_SAMPLE_TIME_NUM] = {0U};
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.9', 'Review shows that usage macro NULL does not have any negative drawbacks');
            cy_stc_autanalog_sar_hs_chan_t *hsGpioChan[PASS_SAR_SAR_GPIO_CHANNELS] = {NULL};

            cy_en_autanalog_sar_vref_t hsVref = (NULL != sarStaCfg->hsStaCfg) ? sarStaCfg->hsStaCfg->hsVref : CY_AUTANALOG_SAR_VREF_VDDA;
            uint8_t hsGpioResultMask = (NULL != sarStaCfg->hsStaCfg) ? sarStaCfg->hsStaCfg->hsGpioResultMask : 0U;
            if (NULL != sarStaCfg->hsStaCfg)
            {
                (void)memcpy(hsSampleTime, sarStaCfg->hsStaCfg->hsSampleTime, sizeof(hsSampleTime));
                (void)memcpy(hsGpioChan, sarStaCfg->hsStaCfg->hsGpioChan, sizeof(hsGpioChan));
            }

