PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog_sar.c
            bool lpDiffEn = (NULL != sarStaCfg->lpStaCfg) ? sarStaCfg->lpStaCfg->lpDiffEn : false;
            cy_en_autanalog_sar_vref_t lpVref = (NULL != sarStaCfg->lpStaCfg) ? sarStaCfg->lpStaCfg->lpVref : CY_AUTANALOG_SAR_VREF_VDDA;
            uint16_t lpSampleTime[CY_AUTANALOG_SAR_SAMPLE_TIME_NUM] = {0U};
            if (NULL != sarStaCfg->lpStaCfg)
            {
                (void)memcpy(lpSampleTime, sarStaCfg->lpStaCfg->lpSampleTime, sizeof(lpSampleTime));
            }

            CY_ASSERT_L3(AUTANALOG_SAR_CTRL_VREF(hsVref));
            CY_ASSERT_L3(AUTANALOG_SAR_CTRL_VREF(lpVref));
            CY_ASSERT_L3(AUTANALOG_SAR_CTRL_BUFF_PWR(sarStaCfg->posBufPwr));
            CY_ASSERT_L3(AUTANALOG_SAR_CTRL_BUFF_PWR(sarStaCfg->negBufPwr));
            CY_ASSERT_L3(AUTANALOG_SAR_CTRL_AVG_MODE(sarStaCfg->accMode));
            CY_ASSERT_L3(AUTANALOG_SAR_CTRL_STARTUP_CAL(sarStaCfg->startupCal));

            regVal = _VAL2FLD(SAR_STA_CTRL_HS_VREF_SEL, hsVref);
            regVal |= _VAL2FLD(SAR_STA_CTRL_LP_VREF_SEL, lpVref);
            regVal |= _VAL2FLD(SAR_STA_CTRL_LP_DIFFERENTIAL_EN, lpDiffEn);
            regVal |= _VAL2FLD(SAR_STA_CTRL_BUF0_PWR_MODE, sarStaCfg->posBufPwr);
            regVal |= _VAL2FLD(SAR_STA_CTRL_BUF1_PWR_MODE, sarStaCfg->negBufPwr);
            regVal |= _VAL2FLD(SAR_STA_CTRL_AVG_MODE, sarStaCfg->accMode);
            regVal |= _VAL2FLD(SAR_STA_CTRL_STARTUP_CAL_EN, sarStaCfg->startupCal);
            regVal |= _VAL2FLD(SAR_STA_CTRL_CHAN_ID_EN, sarStaCfg->chanID);
            regVal |= _VAL2FLD(SAR_STA_CTRL_SHIFT_MODE, sarStaCfg->shiftMode);
            AUTANALOG_SAR_CTRL(baseAddr) = regVal;

            CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_SAMPLE_TIME(AUTANALOG_SAR_STA_CFG_TR_HS_CH_DEFAULT_SAMPLE_TIME));
            CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_SAMPLE_TIME(AUTANALOG_SAR_STA_CFG_TR_LP_CH_DEFAULT_SAMPLE_TIME));
            CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_FIR_MASK(sarStaCfg->firResultMask));

            SAR_LoadGpioChan(baseAddr, PASS_SAR_SAR_GPIO_CHANNELS, hsGpioChan);
            SAR_LoadMuxChan(baseAddr, PASS_SAR_SAR_MUX_CHANNELS, sarStaCfg->intMuxChan);
            SAR_LoadRangeCond(baseAddr, (uint8_t)CY_AUTANALOG_SAR_LIMIT_CFG_NUM, sarStaCfg->limitCond);

            /* Set default values for HS/LP trigger sample time */
            regVal = _VAL2FLD(SAR_STA_TR_SAMPLE_TIME_HS_TR_SAMPLE_TIME, AUTANALOG_SAR_STA_CFG_TR_HS_CH_DEFAULT_SAMPLE_TIME);
            regVal |= _VAL2FLD(SAR_STA_TR_SAMPLE_TIME_LP_TR_SAMPLE_TIME, AUTANALOG_SAR_STA_CFG_TR_LP_CH_DEFAULT_SAMPLE_TIME);
            AUTANALOG_SAR_TR_SAMPLE_TIME(baseAddr) = regVal;

            for (cfgIdx = 0U; cfgIdx < CY_AUTANALOG_SAR_SAMPLE_TIME_NUM; cfgIdx++)
            {
                CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_SAMPLE_TIME(hsSampleTime[cfgIdx]));
                CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_SAMPLE_TIME(lpSampleTime[cfgIdx]));

                regVal = _VAL2FLD(SAR_STA_SAMPLE_TIME_HS_SAMPLE_TIME, hsSampleTime[cfgIdx]);
                regVal |= _VAL2FLD(SAR_STA_SAMPLE_TIME_LP_SAMPLE_TIME, lpSampleTime[cfgIdx]);
                AUTANALOG_SAR_SAMPLE_TIME(baseAddr, cfgIdx) = regVal;
            }

            regVal = _VAL2FLD(SAR_STA_CHAN_RESULT_MASK_GPIO_CHAN_RESULT_MASK, hsGpioResultMask);
            regVal |= _VAL2FLD(SAR_STA_CHAN_RESULT_MASK_MUX_CHAN_RESULT_MASK, sarStaCfg->muxResultMask);
            AUTANALOG_SAR_CHAN_RESULT_MASK(baseAddr) = regVal;

            regVal = _VAL2FLD(SAR_STA_FIR_RESULT_MASK_FIR_RESULT_MASK, sarStaCfg->firResultMask);
            AUTANALOG_SAR_FIR_RESULT_MASK(baseAddr) = regVal;

            for (cfgIdx = 0U; cfgIdx < CY_AUTANALOG_SAR_CH_CORR_COEFF_NUM; cfgIdx++)
            {
                CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_CH_GAIN(AUTANALOG_SAR_STA_CFG_CH_DEFAULT_GAIN));
                CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_CH_OFFSET(AUTANALOG_SAR_STA_CFG_CH_DEFAULT_OFFSET));

                /* Set default values for gain and offset */
                regVal = _VAL2FLD(SAR_STA_CHAN_COEFF_GAIN, AUTANALOG_SAR_STA_CFG_CH_DEFAULT_GAIN);
                regVal |= _VAL2FLD(SAR_STA_CHAN_COEFF_OFFSET, ((uint16_t)AUTANALOG_SAR_STA_CFG_CH_DEFAULT_OFFSET) & SAR_STA_CHAN_COEFF_OFFSET_Msk);
                AUTANALOG_SAR_CHAN_COEFF(baseAddr, cfgIdx) = regVal;
            }
        }
    }

    return result;
}


cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadHSseqTable(uint8_t sarIdx, uint8_t seqTabNum, const cy_stc_autanalog_sar_seq_tab_hs_t * seqTabArr)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_SAR_BAD_PARAM;

    uint32_t baseAddr;
    uint32_t regVal;
    uint8_t cfgIdx;

    CY_ASSERT_L2(AUTANALOG_SAR_SEQ_NUM(seqTabNum));

    result = Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr);

    if ((CY_AUTANALOG_SUCCESS == result) && (seqTabNum > 0U) && (NULL != seqTabArr))
    {
        for (cfgIdx = 0U; cfgIdx < seqTabNum; cfgIdx++)
        {
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_MUX_MODE(seqTabArr[cfgIdx].muxMode));
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_MUX_SEL(seqTabArr[cfgIdx].mux0Sel));
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_MUX_SEL(seqTabArr[cfgIdx].mux1Sel));

            regVal =
                _VAL2FLD(SAR_SEQ_HS_DATA_HS_GPIO_CHAN_EN, seqTabArr[cfgIdx].chanEn) |
                _VAL2FLD(SAR_SEQ_HS_DATA_HS_MUX_CHAN_EN_SEL, seqTabArr[cfgIdx].muxMode) |
                _VAL2FLD(SAR_SEQ_HS_DATA_MUX0_CHAN_SEL, seqTabArr[cfgIdx].mux0Sel) |
                _VAL2FLD(SAR_SEQ_HS_DATA_MUX1_CHAN_SEL, seqTabArr[cfgIdx].mux1Sel);

            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_SAMPLE_TIME(seqTabArr[cfgIdx].sampleTime));
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_AVG_CNT(seqTabArr[cfgIdx].accCount));
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_CAL_REQ(seqTabArr[cfgIdx].calReq));
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_NEXT_STATE(seqTabArr[cfgIdx].nextAction));

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_SAMPLE_TIME_EN, seqTabArr[cfgIdx].sampleTimeEn);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_TR_SAMPLE_TIME_EN, 0U); /* Set default value */

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_SAMPLE_TIME_SEL, seqTabArr[cfgIdx].sampleTime);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_AVG_EN, seqTabArr[cfgIdx].accEn);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_AVG_CNT, seqTabArr[cfgIdx].accCount);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_CALIBRATE, seqTabArr[cfgIdx].calReq);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_NEXT_ACTION, seqTabArr[cfgIdx].nextAction);

            AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, cfgIdx) = regVal;
        }
    }
    else
    {
        result = CY_AUTANALOG_SAR_BAD_PARAM;
    }

    return result;
}


cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadLPseqTable(uint8_t sarIdx, uint8_t seqTabNum, const cy_stc_autanalog_sar_seq_tab_lp_t * seqTabArr)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_SAR_BAD_PARAM;

