PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog_sar.c
    uint32_t baseAddr;
    uint32_t regVal;
    uint8_t cfgIdx;

    CY_ASSERT_L2(AUTANALOG_SAR_SEQ_NUM(seqTabNum));

    result = Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr);

    if ((CY_AUTANALOG_SUCCESS == result) && (seqTabNum > 0U) && (NULL != seqTabArr))
    {
        for (cfgIdx = 0U; cfgIdx < seqTabNum; cfgIdx++)
        {
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_MUX_SEL(seqTabArr[cfgIdx].mux0Sel));

            regVal =
                _VAL2FLD(SAR_SEQ_LP_DATA_LP_CHAN_EN, seqTabArr[cfgIdx].chanEn) |
                _VAL2FLD(SAR_SEQ_LP_DATA_CHAN_SEL, seqTabArr[cfgIdx].mux0Sel);

            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_SAMPLE_TIME(seqTabArr[cfgIdx].sampleTime));
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_AVG_CNT(seqTabArr[cfgIdx].accCount));
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_CAL_REQ(seqTabArr[cfgIdx].calReq));
            CY_ASSERT_L3(AUTANALOG_SAR_SEQ_NEXT_STATE(seqTabArr[cfgIdx].nextAction));

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_SAMPLE_TIME_EN, seqTabArr[cfgIdx].sampleTimeEn);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_TR_SAMPLE_TIME_EN, 0U); /* Set default value */

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_SAMPLE_TIME_SEL, seqTabArr[cfgIdx].sampleTime);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_AVG_EN, seqTabArr[cfgIdx].accEn);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_AVG_CNT, seqTabArr[cfgIdx].accCount);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_CALIBRATE, seqTabArr[cfgIdx].calReq);

            regVal |=
                _VAL2FLD(SAR_SEQ_HS_DATA_NEXT_ACTION, seqTabArr[cfgIdx].nextAction);

            AUTANALOG_SAR_SEQ_LP_DATA(baseAddr, cfgIdx) = regVal;
        }
    }
    else
    {
        result = CY_AUTANALOG_SAR_BAD_PARAM;
    }

    return result;
}


cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadFIRconfig(uint8_t sarIdx, uint8_t firIdx, const cy_stc_autanalog_sar_fir_cfg_t * firCfg)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_SAR_BAD_PARAM;

    uint32_t baseAddr;
    uint32_t regVal;
    uint8_t tapIdx;

    CY_ASSERT_L2(AUTANALOG_SAR_FIR_IDX(firIdx));

    if ((NULL != firCfg) && (NULL != firCfg->coeff))
    {
        result = Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr);

        if (CY_AUTANALOG_SUCCESS == result)
        {
            CY_ASSERT_L3(AUTANALOG_SAR_FIR_CHANNEL_SEL(firCfg->chanSel));
            CY_ASSERT_L3(AUTANALOG_SAR_FIR_TAP_SEL(firCfg->tapSel));
            CY_ASSERT_L3(AUTANALOG_SAR_FIR_SHIFT_SEL(firCfg->shiftSel));
            CY_ASSERT_L3(AUTANALOG_SAR_STATUS_SEL(firCfg->firLimit));
            CY_ASSERT_L3(AUTANALOG_MMIO_FIFO_SEL(firCfg->fifoSel));

            regVal = _VAL2FLD(SAR_STA_FIR_CFG_CHANNEL_SEL, firCfg->chanSel);
            regVal |= _VAL2FLD(SAR_STA_FIR_CFG_TAP_SEL, firCfg->tapSel);
            regVal |= _VAL2FLD(SAR_STA_FIR_CFG_SHIFT_SEL, firCfg->shiftSel);
            regVal |= _VAL2FLD(SAR_STA_FIR_CFG_WAIT_TAP_INIT, firCfg->waitTapInit);
            regVal |= _VAL2FLD(SAR_STA_FIR_CFG_STATUS_SEL, firCfg->firLimit);
            regVal |= _VAL2FLD(SAR_STA_FIR_CFG_FIFO_SEL, firCfg->fifoSel);

            AUTANALOG_SAR_FIR_CFG(baseAddr, firIdx) = regVal;

            for (tapIdx = 0U; tapIdx <= firCfg->tapSel; tapIdx++)
            {
                if (0U == firIdx)
                {
                    AUTANALOG_SAR_FIR0_COEF(baseAddr, tapIdx) = (uint32_t)firCfg->coeff[tapIdx];
                }
                else
                {
                    AUTANALOG_SAR_FIR1_COEF(baseAddr, tapIdx) = (uint32_t)firCfg->coeff[tapIdx];
                }
            }
        }
    }

    return result;
}


cy_en_autanalog_status_t Cy_AutAnalog_SAR_FIRloadCoeff(uint8_t sarIdx, uint8_t firIdx, uint8_t firCoeffNum,
        const int16_t *firCoeffArr)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_SAR_BAD_PARAM;

    uint32_t baseAddr;
    uint8_t tapIdx;

    CY_ASSERT_L2(AUTANALOG_SAR_FIR_IDX(firIdx));
    CY_ASSERT_L3(AUTANALOG_SAR_FIR_TAP_SEL(firCoeffNum - 1U));

    if (NULL != firCoeffArr)
    {
        result = Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr);

        if (CY_AUTANALOG_SUCCESS == result)
        {
            for (tapIdx = 0U; tapIdx < firCoeffNum; tapIdx++)
            {
                if (0U == firIdx)
                {
                    AUTANALOG_SAR_FIR0_COEF(baseAddr, tapIdx) = (uint32_t)firCoeffArr[tapIdx];
                }
                else
                {
                    AUTANALOG_SAR_FIR1_COEF(baseAddr, tapIdx) = (uint32_t)firCoeffArr[tapIdx];
                }
            }
        }
    }

    return result;
}


cy_en_autanalog_status_t Cy_AutAnalog_SAR_LoadOffsetGainCorr(uint8_t sarIdx, uint16_t chanGain[], int16_t chanOffset[])
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_SAR_BAD_PARAM;

    uint32_t baseAddr;
    uint32_t regVal;
    uint8_t cfgIdx;

    if ((NULL != chanGain) && (NULL != chanOffset))
    {
        result = Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr);

        if (CY_AUTANALOG_SUCCESS == result)
        {
            for (cfgIdx = 0U; cfgIdx < CY_AUTANALOG_SAR_CH_CORR_COEFF_NUM; cfgIdx++)
            {
                CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_CH_GAIN(chanGain[cfgIdx]));
                CY_ASSERT_L3(AUTANALOG_SAR_STA_CFG_CH_OFFSET(chanOffset[cfgIdx]));

                regVal = _VAL2FLD(SAR_STA_CHAN_COEFF_GAIN, chanGain[cfgIdx]);
                regVal |= _VAL2FLD(SAR_STA_CHAN_COEFF_OFFSET, ((uint16_t)chanOffset[cfgIdx]) & SAR_STA_CHAN_COEFF_OFFSET_Msk);
                AUTANALOG_SAR_CHAN_COEFF(baseAddr, cfgIdx) = regVal;
            }
        }
    }

    return result;
}


float32_t Cy_AutAnalog_SAR_CountsTo_Volts(uint8_t sarIdx, bool sarLP, uint8_t sarSequencer, cy_en_autanalog_sar_input_t sarInput,
        uint8_t sarChannel, uint32_t VrefmV, int32_t sarCounts)
{
    uint32_t  baseAddr;
    uint32_t  sarGain;
    int32_t   sarOffset;
    uint32_t  diffSARdiv = 2U;
    bool     hsDiffmode = false;
    bool      sarMode16 = false;
    float32_t Volts     = 0.0F;

    CY_ASSERT_L2(AUTANALOG_SAR_SEQ_IDX(sarSequencer));
    CY_ASSERT_L2(AUTANALOG_SAR_INPUT(sarInput));
    CY_ASSERT_L2(AUTANALOG_SAR_CHANNEL(sarInput, sarChannel));
    CY_ASSERT_L2(AUTANALOG_SAR_VREF_MAX(VrefmV));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        /* Check ADC resolution and calculate average if any */
        sarCounts = SAR_GetAverageVoltCounts(baseAddr, sarLP, sarSequencer, sarInput, sarChannel, sarCounts, &sarMode16);

        /* Set gain divider depends on ADC architecture and pseudo-differential mode */
        if (sarLP == false)
        {
            /* Get DIFFERENTIAL_EN parameter for GPIO/MUX channel */
            hsDiffmode = (CY_AUTANALOG_SAR_INPUT_GPIO == sarInput) ?
                         _FLD2BOOL(SAR_STA_GPIO_CHAN_CFG_HS_DIFFERENTIAL_EN, AUTANALOG_SAR_GPIO_CHAN_CFG(baseAddr, sarChannel)) :
                         (CY_AUTANALOG_SAR_CHAN_CFG_MUX0_PSEUDO_DIFF == _FLD2VAL(SAR_SEQ_HS_DATA_HS_MUX_CHAN_EN_SEL, AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, sarSequencer)));

