PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog_sar.c
            if (!hsDiffmode)
            {
                diffSARdiv = 1U;
            }
        }

        /* Calculate gain for SAR ADC channel */
        sarGain = sarMode16 ? (uint32_t)AUTANALOG_SAR_MAX_BITS16 : (uint32_t)AUTANALOG_SAR_MAX_BITS12;
        sarGain = CY_SYSLIB_DIV_ROUND(sarGain * (uint32_t) AUTANALOG_SAR_10mV_COUNTS / diffSARdiv, (uint32_t) VrefmV);

        /* Calculate offset for SAR ADC channel */
        sarOffset = SAR_CheckChanOffset(baseAddr, sarLP, sarSequencer, sarInput, sarChannel, sarMode16);

        /* SAR ADC result in V */
        Volts = (((float32_t) sarCounts + (float32_t) sarOffset) * (float32_t) AUTANALOG_SAR_10V_COUNTS) / (float32_t) sarGain;
    }

    return Volts;
}


int16_t Cy_AutAnalog_SAR_CountsTo_mVolts(uint8_t sarIdx, bool sarLP, uint8_t sarSequencer, cy_en_autanalog_sar_input_t sarInput,
        uint8_t sarChannel, uint32_t VrefmV, int32_t sarCounts)
{
    uint32_t baseAddr;
    uint32_t sarGain;
    int32_t  sarOffset;
    uint32_t diffSARdiv = 2U;
    bool     hsDiffmode = false;
    bool     sarMode16 = false;
    int32_t  mVolts    = 0;

    CY_ASSERT_L2(AUTANALOG_SAR_SEQ_IDX(sarSequencer));
    CY_ASSERT_L2(AUTANALOG_SAR_INPUT(sarInput));
    CY_ASSERT_L2(AUTANALOG_SAR_CHANNEL(sarInput, sarChannel));
    CY_ASSERT_L2(AUTANALOG_SAR_VREF_MAX(VrefmV));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        /* Check ADC resolution and calculate average if any */
        sarCounts = SAR_GetAverageVoltCounts(baseAddr, sarLP, sarSequencer, sarInput, sarChannel, sarCounts, &sarMode16);

        /* Set gain divider depends on ADC architecture and pseudo-differential mode */
        if (sarLP == false)
        {
            /* Get DIFFERENTIAL_EN parameter for GPIO/MUX channel */
            hsDiffmode = (CY_AUTANALOG_SAR_INPUT_GPIO == sarInput) ?
                         _FLD2BOOL(SAR_STA_GPIO_CHAN_CFG_HS_DIFFERENTIAL_EN, AUTANALOG_SAR_GPIO_CHAN_CFG(baseAddr, sarChannel)) :
                         (CY_AUTANALOG_SAR_CHAN_CFG_MUX0_PSEUDO_DIFF == _FLD2VAL(SAR_SEQ_HS_DATA_HS_MUX_CHAN_EN_SEL, AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, sarSequencer)));

            if (!hsDiffmode)
            {
                diffSARdiv = 1U;
            }
        }

        /* Calculate gain for SAR ADC channel */
        sarGain = sarMode16 ? (uint32_t)AUTANALOG_SAR_MAX_BITS16 : (uint32_t)AUTANALOG_SAR_MAX_BITS12;
        sarGain = CY_SYSLIB_DIV_ROUND(sarGain * (uint32_t) AUTANALOG_SAR_10mV_COUNTS / diffSARdiv, (uint32_t) VrefmV);

        /* Calculate offset for SAR ADC channel */
        sarOffset = SAR_CheckChanOffset(baseAddr, sarLP, sarSequencer, sarInput, sarChannel, sarMode16);

        /* SAR ADC result in mV */
        sarCounts += (int32_t) sarOffset;
        mVolts = sarCounts * (int32_t) AUTANALOG_SAR_10mV_COUNTS;
        if (sarCounts > 0)
        {
            mVolts += (int32_t) sarGain / 2;
        }
        else
        {
            mVolts -= (int32_t) sarGain / 2;
        }
        mVolts /= (int32_t) sarGain;
    }

    return (int16_t) mVolts;
}


int32_t Cy_AutAnalog_SAR_CountsTo_uVolts(uint8_t sarIdx, bool sarLP, uint8_t sarSequencer, cy_en_autanalog_sar_input_t sarInput,
        uint8_t sarChannel, uint32_t VrefmV, int32_t sarCounts)
{
    uint32_t baseAddr;
    uint32_t sarGain;
    int32_t  sarOffset;
    uint32_t diffSARdiv = 2U;
    bool     hsDiffmode = false;
    bool     sarMode16 = false;
    int64_t  uVolts    = 0;

    CY_ASSERT_L2(AUTANALOG_SAR_SEQ_IDX(sarSequencer));
    CY_ASSERT_L2(AUTANALOG_SAR_INPUT(sarInput));
    CY_ASSERT_L2(AUTANALOG_SAR_CHANNEL(sarInput, sarChannel));
    CY_ASSERT_L2(AUTANALOG_SAR_VREF_MAX(VrefmV));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        /* Check ADC resolution and calculate average if any */
        sarCounts = SAR_GetAverageVoltCounts(baseAddr, sarLP, sarSequencer, sarInput, sarChannel, sarCounts, &sarMode16);

        /* Set gain divider depends on ADC architecture and pseudo-differential mode */
        if (sarLP == false)
        {
            /* Get DIFFERENTIAL_EN parameter for GPIO/MUX channel */
            hsDiffmode = (CY_AUTANALOG_SAR_INPUT_GPIO == sarInput) ?
                         _FLD2BOOL(SAR_STA_GPIO_CHAN_CFG_HS_DIFFERENTIAL_EN, AUTANALOG_SAR_GPIO_CHAN_CFG(baseAddr, sarChannel)) :
                         (CY_AUTANALOG_SAR_CHAN_CFG_MUX0_PSEUDO_DIFF == _FLD2VAL(SAR_SEQ_HS_DATA_HS_MUX_CHAN_EN_SEL, AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, sarSequencer)));

            if (!hsDiffmode)
            {
                diffSARdiv = 1U;
            }
        }

        /* Calculate gain for SAR ADC channel */
        sarGain = sarMode16 ? (uint32_t)AUTANALOG_SAR_MAX_BITS16 : (uint32_t)AUTANALOG_SAR_MAX_BITS12;
        sarGain = CY_SYSLIB_DIV_ROUND(sarGain * (uint32_t) AUTANALOG_SAR_10mV_COUNTS / diffSARdiv, (uint32_t) VrefmV);

        /* Calculate offset for SAR ADC channel */
        sarOffset = SAR_CheckChanOffset(baseAddr, sarLP, sarSequencer, sarInput, sarChannel, sarMode16);

        /* SAR ADC result in uV */
        uVolts = (((int64_t) sarCounts + (int64_t) sarOffset) * (int64_t) AUTANALOG_SAR_10uV_COUNTS) / (int64_t) sarGain;
    }

    return (int32_t) uVolts;
}


int16_t Cy_AutAnalog_SAR_CountsTo_degreeC(uint8_t sarIdx, bool sarLP, uint8_t sarSequencer, uint8_t sarChannel,
        int32_t sarCounts)
{
    uint32_t                    baseAddr;
    bool                        accEn;
    cy_en_autanalog_sar_acc_mode_t accMode;
    bool                        accShift;
    bool                        avgShiftMode16;
    uint8_t                     avgCnt;

    int32_t                     temp = 0;

    CY_ASSERT_L2(AUTANALOG_SAR_SEQ_IDX(sarSequencer));
    CY_ASSERT_L2(AUTANALOG_SAR_CHANNEL(CY_AUTANALOG_SAR_INPUT_MUX, sarChannel));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_SAR, sarIdx, &baseAddr))
    {
        /* Get AVG_EN parameter for SAR ADC sequencer */
        accEn = (sarLP == false) ?
                _FLD2BOOL(SAR_SEQ_HS_DATA_AVG_EN, AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, sarSequencer)) :
                _FLD2BOOL(SAR_SEQ_LP_DATA_AVG_EN, AUTANALOG_SAR_SEQ_LP_DATA(baseAddr, sarSequencer));

        /* Get AVG_MODE parameter for SAR ADC channel */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Review shows that conversion from uint32_t to enum does not have any negative drawbacks');
        accMode = (cy_en_autanalog_sar_acc_mode_t)_FLD2VAL(SAR_STA_CTRL_AVG_MODE, AUTANALOG_SAR_CTRL(baseAddr));

        /* Get SHIFT_MODE parameter for SAR ADC channel */
        avgShiftMode16 = _FLD2BOOL(SAR_STA_CTRL_SHIFT_MODE, AUTANALOG_SAR_CTRL(baseAddr));

        /* Averaging is configured */
        if (accEn && (accMode != CY_AUTANALOG_SAR_ACC_DISABLED))
        {
            /* Get AVG_SHIFT parameter for SAR ADC channel */
            accShift = _FLD2BOOL(SAR_STA_MUX_CHAN_CFG_AVG_SHIFT, AUTANALOG_SAR_MUX_CHAN_CFG(baseAddr, sarChannel));

            /* Get AVG_CNT parameter for SAR ADC sequencer */
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Review shows that conversion from uint32_t to uint8_t does not have any negative drawbacks');
            avgCnt = (sarLP == false) ?
                     _FLD2VAL(SAR_SEQ_HS_DATA_AVG_CNT, AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, sarSequencer)) :
                     _FLD2VAL(SAR_SEQ_LP_DATA_AVG_CNT, AUTANALOG_SAR_SEQ_LP_DATA(baseAddr, sarSequencer));

