PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog_sar.c
            /* Averaging is not done in HW */
            if (!accShift || (avgShiftMode16 && (avgCnt < (uint8_t)CY_AUTANALOG_SAR_ACC_CNT32)))
            {
                /* Calculate average value in 16b presentation */
                sarCounts = SAR_GetAverageTempCounts(avgShiftMode16, avgCnt, sarCounts);
            }
        }

        /* Shift 12b value to 16b */
        if (!avgShiftMode16)
        {
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.1', 'Review shows that operator "<<" does not have any negative drawbacks');
            sarCounts <<= 4UL;
        }

        /* Calculate die temperature based on SAR ACD counts in 16b presentation */
        temp = SAR_CountsToDegreeC(sarLP, sarCounts);
    }

    return (int16_t) temp;
}


cy_en_autanalog_status_t Cy_AutAnalog_FIFO_LoadConfig(uint8_t fifoIdx, const cy_stc_autanalog_fifo_cfg_t * fifoCfg)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_FIFO_BAD_PARAM;

    uint32_t baseAddr;
    uint32_t regVal;
    uint8_t cfgIdx;

    result = Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_FIFO, fifoIdx, &baseAddr);

    if ((CY_AUTANALOG_SUCCESS == result) && (NULL != fifoCfg))
    {
        /* Update CFG register */
        /* Validate enumerations for CFG register */
        CY_ASSERT_L3(AUTANALOG_MMIO_FIFO_CFG(fifoCfg->split));

        regVal = _VAL2FLD(LPPASS_MMIO_STA_CFG_SEL, fifoCfg->split);

        AUTANALOG_MMIO_FIFO_STA_CFG(baseAddr) = regVal;

        /* Update LEVEL[] registers */
        for (cfgIdx = 0U; cfgIdx < CY_AUTANALOG_FIFO_BUFS_NUM; cfgIdx++)
        {
            /* Validate enumerations for LEVEL[] registers */
            CY_ASSERT_L3(AUTANALOG_MMIO_FIFO_LEVEL(fifoCfg->level[cfgIdx]));

            regVal = _VAL2FLD(LPPASS_MMIO_STA_LEVEL_LEVEL, fifoCfg->level[cfgIdx]);

            AUTANALOG_MMIO_FIFO_STA_LEVEL(baseAddr, cfgIdx) = regVal;
        }
    }
    else
    {
        result = CY_AUTANALOG_FIFO_BAD_PARAM;
    }

    return result;
}


uint16_t Cy_AutAnalog_FIFO_ReadData(uint8_t fifoIdx, uint8_t buffIdx, uint16_t words, int32_t * data)
{
    uint16_t locSize = 0U;

    CY_ASSERT_L2(AUTANALOG_MMIO_FIFO_BUFF_IDX(buffIdx));

    if (NULL != data && words > 0U)
    {
        locSize = Cy_AutAnalog_FIFO_GetSize(fifoIdx, buffIdx);

        locSize = (words <= locSize) ? words : locSize;

        for (uint16_t idx = 0U; idx < locSize; idx++)
        {
            data[idx] = Cy_AutAnalog_FIFO_ReadWord(fifoIdx, buffIdx);
        }
    }

    return locSize;
}


uint16_t Cy_AutAnalog_FIFO_ReadAllData(uint8_t fifoIdx, uint8_t buffIdx, int32_t * data)
{
    uint16_t locSize = 0U;

    CY_ASSERT_L2(AUTANALOG_MMIO_FIFO_BUFF_IDX(buffIdx));

    if (NULL != data)
    {
        locSize = Cy_AutAnalog_FIFO_GetSize(fifoIdx, buffIdx);

        for (uint16_t idx = 0U; idx < locSize; idx++)
        {
            data[idx] = Cy_AutAnalog_FIFO_ReadWord(fifoIdx, buffIdx);
        }
    }

    return locSize;
}


uint16_t Cy_AutAnalog_FIFO_ReadDataChanId(uint8_t fifoIdx, uint8_t buffIdx, cy_en_autanalog_sar_input_t input, int32_t * data, uint8_t * chanID)
{
    uint16_t locSize = 0U;
    uint32_t locData = 0U;

    CY_ASSERT_L2(AUTANALOG_SAR_INPUT(input));

    if ((NULL != data) && (NULL != chanID))
    {
        locSize = Cy_AutAnalog_FIFO_GetSize(fifoIdx, buffIdx);

        for (uint16_t idx = 0U; idx < locSize; idx++)
        {
            CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'Review shows that type conversion from signed to unsigned does not have any negative drawbacks');
            locData = (uint32_t)Cy_AutAnalog_FIFO_ReadWord(fifoIdx, buffIdx);
            CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');

            CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.3', 1, 'Review shows that type conversion from uint32_t to uint8_t does not have any negative drawbacks');
            chanID[idx] = (CY_AUTANALOG_SAR_INPUT_GPIO == input) ?
                          (locData & AUTANALOG_MMIO_FIFO_CH_ID_MASK_GPIO) >> AUTANALOG_MMIO_FIFO_CH_ID_POS_GPIO :
                          (locData & AUTANALOG_MMIO_FIFO_CH_ID_MASK_MUX)  >> AUTANALOG_MMIO_FIFO_CH_ID_POS_MUX;
            CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.3');

            CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.3', 2, 'Review shows that type conversion from uint16_t to int32_t does not have any negative drawbacks');
            data[idx] = ((locData & AUTANALOG_MMIO_FIFO_SIGN_MASK) == AUTANALOG_MMIO_FIFO_SIGN_MASK) ?
                        (int32_t)(int16_t)CY_LO16(locData) :
                        (int32_t)CY_LO16(locData);
            CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.3');
        }
    }

    return locSize;
}


#if !defined (CY_AUTANALOG_FIR_DISABLE)
static cy_en_autanalog_status_t SAR_LoadFIR(uint8_t sarIdx, uint8_t cfgNum, const cy_stc_autanalog_sar_fir_cfg_t * firCfg)
{
    cy_en_autanalog_status_t result = CY_AUTANALOG_SUCCESS;

    uint8_t cfgIdx;

    for (cfgIdx = 0U; cfgIdx < cfgNum; cfgIdx++)
    {
        CY_ASSERT_L3(AUTANALOG_SAR_FIR_IDX(cfgIdx));

        if (CY_AUTANALOG_SUCCESS != Cy_AutAnalog_SAR_LoadFIRconfig(sarIdx, cfgIdx, &firCfg[cfgIdx]))
        {
            result = CY_AUTANALOG_SAR_BAD_PARAM;
            break;
        }
    }

    return result;
}
#endif


static void SAR_LoadGpioChan(uint32_t baseAddr, uint8_t cfgNum, cy_stc_autanalog_sar_hs_chan_t * const hsGpioChan[])
{
    uint32_t regVal;
    uint8_t cfgIdx;

    if (NULL != hsGpioChan)
    {
        for (cfgIdx = 0U; cfgIdx < cfgNum; cfgIdx++)
        {
            CY_ASSERT_L3(AUTANALOG_SAR_CHANNEL(CY_AUTANALOG_SAR_INPUT_GPIO, cfgIdx));

            if (NULL != hsGpioChan[cfgIdx])
            {
                CY_ASSERT_L3(AUTANALOG_SAR_GPIO_PIN(hsGpioChan[cfgIdx]->posPin));
                CY_ASSERT_L3(AUTANALOG_SAR_CH_COEF(hsGpioChan[cfgIdx]->posCoeff));
                CY_ASSERT_L3(AUTANALOG_SAR_GPIO_PIN(hsGpioChan[cfgIdx]->negPin));
                CY_ASSERT_L3(AUTANALOG_SAR_CH_COEF(hsGpioChan[cfgIdx]->negCoeff));
                CY_ASSERT_L3(AUTANALOG_SAR_STATUS_SEL(hsGpioChan[cfgIdx]->hsLimit));
                CY_ASSERT_L3(AUTANALOG_MMIO_FIFO_SEL(hsGpioChan[cfgIdx]->fifoSel));

                regVal = _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_POS_PIN, hsGpioChan[cfgIdx]->posPin);
                regVal |= _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_HS_DIFFERENTIAL_EN, hsGpioChan[cfgIdx]->hsDiffEn);
                regVal |= _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_SIGNED, hsGpioChan[cfgIdx]->sign);
                regVal |= _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_POS_COEFF_SEL, hsGpioChan[cfgIdx]->posCoeff);
                regVal |= _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_NEG_PIN, hsGpioChan[cfgIdx]->negPin);
                regVal |= _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_AVG_SHIFT, hsGpioChan[cfgIdx]->accShift);
                regVal |= _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_NEG_COEFF_SEL, hsGpioChan[cfgIdx]->negCoeff);
                regVal |= _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_STATUS_SEL, hsGpioChan[cfgIdx]->hsLimit);
                regVal |= _VAL2FLD(SAR_STA_GPIO_CHAN_CFG_FIFO_SEL, hsGpioChan[cfgIdx]->fifoSel);

                AUTANALOG_SAR_GPIO_CHAN_CFG(baseAddr, cfgIdx) = regVal;
            }
            else
            {
                AUTANALOG_SAR_GPIO_CHAN_CFG(baseAddr, cfgIdx) = 0U;
            }
        }
    }
}


static void SAR_LoadMuxChan(uint32_t baseAddr, uint8_t cfgNum, cy_stc_autanalog_sar_mux_chan_t * const intMuxChan[])
{
    uint32_t regVal;
    uint8_t cfgIdx;

