PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog_sar.c
    if (NULL != intMuxChan)
    {
        for (cfgIdx = 0U; cfgIdx < cfgNum; cfgIdx++)
        {
            CY_ASSERT_L3(AUTANALOG_SAR_CHANNEL(CY_AUTANALOG_SAR_INPUT_MUX, cfgIdx));

            if (NULL != intMuxChan[cfgIdx])
            {
                CY_ASSERT_L3(AUTANALOG_SAR_MUX_PIN(intMuxChan[cfgIdx]->posPin));
                CY_ASSERT_L3(AUTANALOG_SAR_CH_COEF(intMuxChan[cfgIdx]->posCoeff));
                CY_ASSERT_L3(AUTANALOG_SAR_MUX_PIN(intMuxChan[cfgIdx]->negPin));
                CY_ASSERT_L3(AUTANALOG_SAR_CH_COEF(intMuxChan[cfgIdx]->negCoeff));
                CY_ASSERT_L3(AUTANALOG_SAR_STATUS_SEL(intMuxChan[cfgIdx]->muxLimit));
                CY_ASSERT_L3(AUTANALOG_MMIO_FIFO_SEL(intMuxChan[cfgIdx]->fifoSel));

                regVal = _VAL2FLD(SAR_STA_MUX_CHAN_CFG_POS_MUX_SEL, intMuxChan[cfgIdx]->posPin);
                regVal |= _VAL2FLD(SAR_STA_MUX_CHAN_CFG_SIGNED, intMuxChan[cfgIdx]->sign);
                regVal |= _VAL2FLD(SAR_STA_MUX_CHAN_CFG_POS_COEFF_SEL, intMuxChan[cfgIdx]->posCoeff);
                regVal |= _VAL2FLD(SAR_STA_MUX_CHAN_CFG_NEG_MUX_SEL, intMuxChan[cfgIdx]->negPin);
                regVal |= _VAL2FLD(SAR_STA_MUX_CHAN_CFG_BUF_BYPASS, intMuxChan[cfgIdx]->buffBypass);
                regVal |= _VAL2FLD(SAR_STA_MUX_CHAN_CFG_AVG_SHIFT, intMuxChan[cfgIdx]->accShift);
                regVal |= _VAL2FLD(SAR_STA_MUX_CHAN_CFG_NEG_COEFF_SEL, intMuxChan[cfgIdx]->negCoeff);
                regVal |= _VAL2FLD(SAR_STA_MUX_CHAN_CFG_STATUS_SEL, intMuxChan[cfgIdx]->muxLimit);
                regVal |= _VAL2FLD(SAR_STA_MUX_CHAN_CFG_FIFO_SEL, intMuxChan[cfgIdx]->fifoSel);

                AUTANALOG_SAR_MUX_CHAN_CFG(baseAddr, cfgIdx) = regVal;
            }
            else
            {
                AUTANALOG_SAR_MUX_CHAN_CFG(baseAddr, cfgIdx) = 0U;
            }
        }
    }
}


static void SAR_LoadRangeCond(uint32_t baseAddr, uint8_t cfgNum, cy_stc_autanalog_sar_limit_t * const limitCond[])
{
    uint32_t regVal;
    uint8_t cfgIdx;

    if (NULL != limitCond)
    {
        for (cfgIdx = 0U; cfgIdx < cfgNum; cfgIdx++)
        {
            if (NULL != limitCond[cfgIdx])
            {
                CY_ASSERT_L3(AUTANALOG_SAR_STATUS_COND(limitCond[cfgIdx]->cond));

                regVal = _VAL2FLD(SAR_STA_STATUS_CFG_RANGE_COND, limitCond[cfgIdx]->cond);
                AUTANALOG_SAR_STATUS_CFG(baseAddr, cfgIdx) = regVal;

                regVal = (uint32_t)_VAL2FLD(SAR_STA_STATUS_RANGE_LOW_RANGE_LOW, limitCond[cfgIdx]->low);
                AUTANALOG_SAR_STATUS_RANGE_LOW(baseAddr, cfgIdx) = regVal;

                regVal = (uint32_t)_VAL2FLD(SAR_STA_STATUS_RANGE_HIGH_RANGE_HIGH, limitCond[cfgIdx]->high);
                AUTANALOG_SAR_STATUS_RANGE_HIGH(baseAddr, cfgIdx) = regVal;
            }
            else
            {
                AUTANALOG_SAR_STATUS_CFG(baseAddr, cfgIdx) = 0U;
                AUTANALOG_SAR_STATUS_RANGE_LOW(baseAddr, cfgIdx) = 0U;
                AUTANALOG_SAR_STATUS_RANGE_HIGH(baseAddr, cfgIdx) = 0U;
            }
        }
    }
}


static int32_t SAR_CheckChanOffset(uint32_t baseAddr, bool sarLP, uint8_t sarSequencer, cy_en_autanalog_sar_input_t sarInput,
                                   uint8_t sarChannel, bool sarMode16)
{
    int32_t offset;

    bool sign = false;
    bool diff = false;

    /* In pseudo-differential mode the result voltage after subtraction can be negative */
    if (CY_AUTANALOG_SAR_INPUT_GPIO == sarInput)
    {
        /* Get HS_DIFFERENTIAL_EN parameter for GPIO channel */
        diff = _FLD2BOOL(SAR_STA_GPIO_CHAN_CFG_HS_DIFFERENTIAL_EN, AUTANALOG_SAR_GPIO_CHAN_CFG(baseAddr, sarChannel));

        /* Get SIGN parameter for GPIO channel in pseudo-differential mode */
        sign = _FLD2BOOL(SAR_STA_GPIO_CHAN_CFG_SIGNED, AUTANALOG_SAR_GPIO_CHAN_CFG(baseAddr, sarChannel));
    }
    /* Reference voltage can be routed to negative pin of SAR ADC just for MUX channels */
    else if (CY_AUTANALOG_SAR_INPUT_MUX == sarInput)
    {
        /* Get SIGN parameter for MUX channel */
        sign = _FLD2BOOL(SAR_STA_MUX_CHAN_CFG_SIGNED, AUTANALOG_SAR_MUX_CHAN_CFG(baseAddr, sarChannel));

        /* Get DIFFERENTIAL_EN parameter for MUX channel */
        diff = sarLP ? _FLD2BOOL(SAR_STA_CTRL_LP_DIFFERENTIAL_EN, AUTANALOG_SAR_CTRL(baseAddr)) :
               (CY_AUTANALOG_SAR_CHAN_CFG_MUX0_PSEUDO_DIFF == _FLD2VAL(SAR_SEQ_HS_DATA_HS_MUX_CHAN_EN_SEL, AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, sarSequencer)));
    }
    else
    {
        /* MISRA */
    }

    /* For signed, not pseudo-differential channels in single-ended mode, offset should be set to half of scale with positive sign,
     * depend on SAR ADC numeric resolution.
     */
    if (sign && !diff)
    {
        offset = sarMode16 ? AUTANALOG_SAR_OFFSET_BITS16 : AUTANALOG_SAR_OFFSET_BITS12;
    }
    /* For unsigned differential channels, offset should be set to half of scale with negative sign,
     * depend on SAR ADC numeric resolution.
     */
    else if (!sign && diff)
    {
        offset = sarMode16 ? -AUTANALOG_SAR_OFFSET_BITS16 : -AUTANALOG_SAR_OFFSET_BITS12;
    }
    else
    {
        offset = 0;
    }

    return offset;
}


static int32_t SAR_GetAverageVoltCounts(uint32_t baseAddr, bool sarLP, uint8_t sarSequencer,
                                        cy_en_autanalog_sar_input_t sarInput, uint8_t sarChannel, int32_t sarCounts, bool * sarMode16)
{
    bool                           avgEn;
    cy_en_autanalog_sar_acc_mode_t avgMode;
    uint8_t                        avgCnt;
    bool                           avgShift;
    bool                           avgShiftMode16 = false;

    /* Get AVG_EN parameter for SAR ADC sequencer */
    avgEn = (sarLP == false) ?
            _FLD2BOOL(SAR_SEQ_HS_DATA_AVG_EN, AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, sarSequencer)) :
            _FLD2BOOL(SAR_SEQ_LP_DATA_AVG_EN, AUTANALOG_SAR_SEQ_LP_DATA(baseAddr, sarSequencer));

    /* Get AVG_MODE parameter for SAR ADC channel */
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Review shows that conversion from uint32_t to enum does not have any negative drawbacks');
    avgMode = (cy_en_autanalog_sar_acc_mode_t)_FLD2VAL(SAR_STA_CTRL_AVG_MODE, AUTANALOG_SAR_CTRL(baseAddr));

    /* Check if average is enabled */
    if (avgEn && (avgMode != CY_AUTANALOG_SAR_ACC_DISABLED))
    {
        /* Get AVG_CNT parameter for SAR ADC sequencer */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Review shows that conversion from uint32_t to uint8_t does not have any negative drawbacks');
        avgCnt = (sarLP == false) ?
                 _FLD2VAL(SAR_SEQ_HS_DATA_AVG_CNT, AUTANALOG_SAR_SEQ_HS_DATA(baseAddr, sarSequencer)) :
                 _FLD2VAL(SAR_SEQ_LP_DATA_AVG_CNT, AUTANALOG_SAR_SEQ_LP_DATA(baseAddr, sarSequencer));

