PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_autanalog_sar.c
        /* Get AVG_SHIFT parameter for SAR ADC channel */
        avgShift = (sarInput == CY_AUTANALOG_SAR_INPUT_GPIO) ?
                   _FLD2BOOL(SAR_STA_GPIO_CHAN_CFG_AVG_SHIFT, AUTANALOG_SAR_GPIO_CHAN_CFG(baseAddr, sarChannel)) :
                   _FLD2BOOL(SAR_STA_MUX_CHAN_CFG_AVG_SHIFT, AUTANALOG_SAR_MUX_CHAN_CFG(baseAddr, sarChannel));

        /* Get SHIFT_MODE parameter for SAR ADC channel */
        avgShiftMode16 = _FLD2BOOL(SAR_STA_CTRL_SHIFT_MODE, AUTANALOG_SAR_CTRL(baseAddr));

        /* Averaging is configured but division is not done in HW */
        if (!avgShift)
        {
            /* Calculate average value */
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Review shows that conversion from unsigned to signed does not have any negative drawbacks');
            sarCounts /= (int32_t)(1UL << (avgCnt + 1UL));
        }

        /* Counts value is within 12bits resolution */
        if (((sarCounts < 0) && (sarCounts > -4096)) || (((uint32_t)sarCounts <= 4095U)))
        {
            avgShiftMode16 = false;
        }
    }

    if (NULL != sarMode16)
    {
        *sarMode16 = avgShiftMode16;
    }

    return sarCounts;
}


static int32_t SAR_GetAverageTempCounts(bool avgShiftMode16, uint8_t avgCnt, int32_t sarCounts)
{
    uint16_t avgDivider;

    /* Calculate divider value */
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.3', 'Review shows that conversion from uint32_t to uint16_t does not have any negative drawbacks');
    avgDivider = (uint16_t)(1UL << (avgCnt + 1UL));

    /* Averaged value */
    sarCounts /= (int32_t)avgDivider;

    /* Shift 12b value to 16b */
    if (avgShiftMode16)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.1', 'Review shows that operator "<<" does not have any negative drawbacks');
        sarCounts <<= 4UL;
    }

    return sarCounts;
}


static int32_t SAR_CountsToDegreeC(bool sarLP, int32_t sarCounts)
{
    int32_t temp = sarCounts;

    /* Calculate tInitial in Q16.16 */
    if (true == sarLP)
    {
        temp = ((int32_t)cyAutanalogTempMultiplierLP * temp) +
               ((int32_t)cyAutanalogTempOffsetLP);
    }
    else
    {
        temp = ((int32_t)cyAutanalogTempMultiplierHS * temp) +
               ((int32_t)cyAutanalogTempOffsetHS);
    }

    /* Add tInitial + 0.5 to round to nearest int. Shift off frac bits, and return. */
    temp = (temp + AUTANALOG_SAR_TEMP_HALF) / AUTANALOG_SAR_TEMP_DIV;

    return temp;
}

#endif /* CY_IP_MXS22LPPASS_SAR */

/* [] END OF FILE */
